tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/services"
brew "bash"
brew "bash-completion@2"
brew "cocoapods"
brew "gh"
brew "git"
brew "imagemagick"
brew "node"
brew "node@18"
brew "scrcpy"
brew "tree"
cask "alfred"
cask "android-platform-tools"
cask "appcleaner"
cask "brave-browser"
cask "dbeaver-community"
cask "devtoys"
cask "discord"
cask "docker"
cask "dropbox"
cask "evernote"
cask "fig"
cask "firefox"
cask "franz"
cask "free-ruler"
cask "google-chrome"
cask "hyper"
cask "imageoptim"
cask "notion"
cask "postman"
cask "qlmarkdown"
cask "quicklook-json"
cask "recordit"
cask "responsively"
cask "spotify"
cask "tableplus"
cask "the-unarchiver"
cask "toggl-track"
cask "visual-studio-code"
cask "vlc"
cask "xmind"
cask "zeplin"
vscode "Arjun.swagger-viewer"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "esbenp.prettier-vscode"
vscode "eseom.nunjucks-template"
vscode "file-icons.file-icons"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "GitHub.copilot"
vscode "Gruntfuggly.todo-tree"
vscode "Ionic.ionic"
vscode "ionutvmi.path-autocomplete"
vscode "lokalise.i18n-ally"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "nrwl.angular-console"
vscode "octref.vetur"
vscode "oouo-diogo-perdigao.docthis"
vscode "redhat.vscode-yaml"
vscode "runem.lit-plugin"
vscode "streetsidesoftware.code-spell-checker"
vscode "Vue.volar"
vscode "Vue.vscode-typescript-vue-plugin"
vscode "withfig.fig"
vscode "wix.vscode-import-cost"
vscode "zhuangtongfa.material-theme"
